2ClientData/Clients/armMultipleClientsRps/200_t32_Ares.txt
====== SET ======
  100074 requests completed in 1.07 seconds
  200 parallel clients
  100 bytes payload
  keep alive: 1

0.55% <= 1 milliseconds
87.14% <= 2 milliseconds
99.88% <= 3 milliseconds
100.00% <= 4 milliseconds
93439.78 requests per second

====== GET ======
  100003 requests completed in 1.09 seconds
  200 parallel clients
  100 bytes payload
  keep alive: 1

0.00% <= 0 milliseconds
0.27% <= 1 milliseconds
87.87% <= 2 milliseconds
99.73% <= 3 milliseconds
100.00% <= 4 milliseconds
91999.08 requests per second


====== SET ======
  100006 requests completed in 1.12 seconds
  200 parallel clients
  100 bytes payload
  keep alive: 1

0.22% <= 1 milliseconds
76.65% <= 2 milliseconds
99.42% <= 3 milliseconds
99.80% <= 4 milliseconds
99.98% <= 5 milliseconds
100.00% <= 6 milliseconds
88894.22 requests per second

====== GET ======
  100055 requests completed in 1.11 seconds
  200 parallel clients
  100 bytes payload
  keep alive: 1

0.17% <= 1 milliseconds
80.48% <= 2 milliseconds
99.73% <= 3 milliseconds
100.00% <= 4 milliseconds
90547.51 requests per second


====== SET ======
  100004 requests completed in 1.12 seconds
  200 parallel clients
  100 bytes payload
  keep alive: 1

0.01% <= 0 milliseconds
0.21% <= 1 milliseconds
77.16% <= 2 milliseconds
99.08% <= 3 milliseconds
99.96% <= 4 milliseconds
100.00% <= 5 milliseconds
100.00% <= 6 milliseconds
88892.45 requests per second

====== GET ======
  100030 requests completed in 1.10 seconds
  200 parallel clients
  100 bytes payload
  keep alive: 1

0.00% <= 0 milliseconds
0.21% <= 1 milliseconds
82.60% <= 2 milliseconds
98.81% <= 3 milliseconds
100.00% <= 4 milliseconds
91102.00 requests per second


====== SET ======
  100057 requests completed in 1.07 seconds
  200 parallel clients
  100 bytes payload
  keep alive: 1

0.93% <= 1 milliseconds
85.83% <= 2 milliseconds
99.65% <= 3 milliseconds
100.00% <= 4 milliseconds
100.00% <= 5 milliseconds
93162.95 requests per second

====== GET ======
  100066 requests completed in 1.09 seconds
  200 parallel clients
  100 bytes payload
  keep alive: 1

0.19% <= 1 milliseconds
82.83% <= 2 milliseconds
99.96% <= 3 milliseconds
100.00% <= 4 milliseconds
91719.52 requests per second


====== SET ======
  100003 requests completed in 1.07 seconds
  200 parallel clients
  100 bytes payload
  keep alive: 1

0.00% <= 0 milliseconds
0.64% <= 1 milliseconds
87.55% <= 2 milliseconds
99.86% <= 3 milliseconds
100.00% <= 4 milliseconds
93899.52 requests per second

====== GET ======
  100000 requests completed in 1.09 seconds
  200 parallel clients
  100 bytes payload
  keep alive: 1

0.26% <= 1 milliseconds
83.31% <= 2 milliseconds
99.28% <= 3 milliseconds
100.00% <= 4 milliseconds
100.00% <= 5 milliseconds
91575.09 requests per second


====== SET ======
  100007 requests completed in 1.08 seconds
  200 parallel clients
  100 bytes payload
  keep alive: 1

0.01% <= 0 milliseconds
0.72% <= 1 milliseconds
84.32% <= 2 milliseconds
99.47% <= 3 milliseconds
99.98% <= 4 milliseconds
100.00% <= 5 milliseconds
92342.57 requests per second

====== GET ======
  100095 requests completed in 1.06 seconds
  200 parallel clients
  100 bytes payload
  keep alive: 1

0.00% <= 0 milliseconds
0.38% <= 1 milliseconds
88.55% <= 2 milliseconds
99.42% <= 3 milliseconds
99.95% <= 4 milliseconds
100.00% <= 5 milliseconds
94074.25 requests per second


====== SET ======
  100075 requests completed in 1.10 seconds
  200 parallel clients
  100 bytes payload
  keep alive: 1

0.01% <= 0 milliseconds
0.54% <= 1 milliseconds
81.93% <= 2 milliseconds
98.92% <= 3 milliseconds
99.91% <= 4 milliseconds
100.00% <= 5 milliseconds
90977.27 requests per second

====== GET ======
  100002 requests completed in 1.11 seconds
  200 parallel clients
  100 bytes payload
  keep alive: 1

0.00% <= 0 milliseconds
0.28% <= 1 milliseconds
82.32% <= 2 milliseconds
99.69% <= 3 milliseconds
100.00% <= 4 milliseconds
90173.13 requests per second


====== SET ======
  100051 requests completed in 1.13 seconds
  200 parallel clients
  100 bytes payload
  keep alive: 1

0.41% <= 1 milliseconds
77.84% <= 2 milliseconds
98.29% <= 3 milliseconds
99.66% <= 4 milliseconds
100.00% <= 5 milliseconds
88855.23 requests per second

====== GET ======
  100004 requests completed in 1.06 seconds
  200 parallel clients
  100 bytes payload
  keep alive: 1

0.23% <= 1 milliseconds
88.95% <= 2 milliseconds
99.83% <= 3 milliseconds
100.00% <= 4 milliseconds
94254.48 requests per second


====== SET ======
  100053 requests completed in 1.12 seconds
  200 parallel clients
  100 bytes payload
  keep alive: 1

0.00% <= 0 milliseconds
0.51% <= 1 milliseconds
78.83% <= 2 milliseconds
98.90% <= 3 milliseconds
99.79% <= 4 milliseconds
99.93% <= 5 milliseconds
100.00% <= 6 milliseconds
89572.96 requests per second

====== GET ======
  100082 requests completed in 1.08 seconds
  200 parallel clients
  100 bytes payload
  keep alive: 1

0.00% <= 0 milliseconds
0.18% <= 1 milliseconds
86.48% <= 2 milliseconds
99.79% <= 3 milliseconds
99.94% <= 4 milliseconds
100.00% <= 5 milliseconds
93099.53 requests per second


====== SET ======
  100039 requests completed in 1.07 seconds
  200 parallel clients
  100 bytes payload
  keep alive: 1

0.01% <= 0 milliseconds
0.62% <= 1 milliseconds
86.23% <= 2 milliseconds
99.97% <= 3 milliseconds
100.00% <= 4 milliseconds
100.00% <= 5 milliseconds
93319.96 requests per second

====== GET ======
  100021 requests completed in 1.08 seconds
  200 parallel clients
  100 bytes payload
  keep alive: 1

0.00% <= 0 milliseconds
0.19% <= 1 milliseconds
85.05% <= 2 milliseconds
99.50% <= 3 milliseconds
99.93% <= 4 milliseconds
100.00% <= 5 milliseconds
100.00% <= 6 milliseconds
92440.85 requests per second


====== SET ======
  100015 requests completed in 1.07 seconds
  200 parallel clients
  100 bytes payload
  keep alive: 1

0.01% <= 0 milliseconds
0.68% <= 1 milliseconds
87.05% <= 2 milliseconds
99.54% <= 3 milliseconds
99.83% <= 4 milliseconds
100.00% <= 5 milliseconds
100.00% <= 6 milliseconds
93384.69 requests per second

====== GET ======
  100014 requests completed in 1.09 seconds
  200 parallel clients
  100 bytes payload
  keep alive: 1

0.19% <= 1 milliseconds
83.38% <= 2 milliseconds
99.80% <= 3 milliseconds
100.00% <= 4 milliseconds
91840.22 requests per second


====== SET ======
  100000 requests completed in 1.07 seconds
  200 parallel clients
  100 bytes payload
  keep alive: 1

0.01% <= 0 milliseconds
0.60% <= 1 milliseconds
86.98% <= 2 milliseconds
99.83% <= 3 milliseconds
100.00% <= 4 milliseconds
93545.37 requests per second

====== GET ======
  100044 requests completed in 1.09 seconds
  200 parallel clients
  100 bytes payload
  keep alive: 1

0.18% <= 1 milliseconds
84.11% <= 2 milliseconds
99.87% <= 3 milliseconds
100.00% <= 4 milliseconds
100.00% <= 5 milliseconds
92206.45 requests per second


====== SET ======
  100051 requests completed in 1.08 seconds
  200 parallel clients
  100 bytes payload
  keep alive: 1

0.58% <= 1 milliseconds
85.55% <= 2 milliseconds
99.63% <= 3 milliseconds
99.99% <= 4 milliseconds
100.00% <= 5 milliseconds
92897.86 requests per second

====== GET ======
  100080 requests completed in 1.10 seconds
  200 parallel clients
  100 bytes payload
  keep alive: 1

0.17% <= 1 milliseconds
81.14% <= 2 milliseconds
99.80% <= 3 milliseconds
100.00% <= 4 milliseconds
90816.70 requests per second


====== SET ======
  100000 requests completed in 1.08 seconds
  200 parallel clients
  100 bytes payload
  keep alive: 1

0.54% <= 1 milliseconds
85.68% <= 2 milliseconds
99.42% <= 3 milliseconds
99.91% <= 4 milliseconds
100.00% <= 5 milliseconds
92678.41 requests per second

====== GET ======
  100011 requests completed in 1.08 seconds
  200 parallel clients
  100 bytes payload
  keep alive: 1

0.17% <= 1 milliseconds
85.99% <= 2 milliseconds
99.91% <= 3 milliseconds
100.00% <= 4 milliseconds
93033.48 requests per second


====== SET ======
  100002 requests completed in 1.14 seconds
  200 parallel clients
  100 bytes payload
  keep alive: 1

0.03% <= 0 milliseconds
1.53% <= 1 milliseconds
78.99% <= 2 milliseconds
95.33% <= 3 milliseconds
98.61% <= 4 milliseconds
99.56% <= 5 milliseconds
99.89% <= 6 milliseconds
99.98% <= 7 milliseconds
100.00% <= 8 milliseconds
100.00% <= 9 milliseconds
88029.93 requests per second

====== GET ======
  100036 requests completed in 1.12 seconds
  200 parallel clients
  100 bytes payload
  keep alive: 1

0.01% <= 0 milliseconds
4.68% <= 1 milliseconds
74.69% <= 2 milliseconds
98.59% <= 3 milliseconds
99.91% <= 4 milliseconds
99.99% <= 5 milliseconds
100.00% <= 6 milliseconds
89557.74 requests per second


====== SET ======
  100000 requests completed in 1.21 seconds
  200 parallel clients
  100 bytes payload
  keep alive: 1

0.04% <= 0 milliseconds
4.32% <= 1 milliseconds
63.41% <= 2 milliseconds
94.07% <= 3 milliseconds
98.55% <= 4 milliseconds
99.58% <= 5 milliseconds
99.87% <= 6 milliseconds
99.97% <= 7 milliseconds
99.99% <= 8 milliseconds
99.99% <= 9 milliseconds
100.00% <= 14 milliseconds
100.00% <= 15 milliseconds
82712.98 requests per second

====== GET ======
  100034 requests completed in 1.12 seconds
  200 parallel clients
  100 bytes payload
  keep alive: 1

0.00% <= 0 milliseconds
2.59% <= 1 milliseconds
75.64% <= 2 milliseconds
98.79% <= 3 milliseconds
99.83% <= 4 milliseconds
99.99% <= 5 milliseconds
100.00% <= 6 milliseconds
100.00% <= 7 milliseconds
88919.11 requests per second


====== SET ======
  100017 requests completed in 1.13 seconds
  200 parallel clients
  100 bytes payload
  keep alive: 1

0.05% <= 0 milliseconds
10.34% <= 1 milliseconds
71.20% <= 2 milliseconds
94.76% <= 3 milliseconds
98.84% <= 4 milliseconds
99.77% <= 5 milliseconds
99.94% <= 6 milliseconds
99.99% <= 7 milliseconds
100.00% <= 8 milliseconds
100.00% <= 9 milliseconds
100.00% <= 10 milliseconds
88354.24 requests per second

====== GET ======
  100047 requests completed in 1.14 seconds
  200 parallel clients
  100 bytes payload
  keep alive: 1

0.01% <= 0 milliseconds
2.41% <= 1 milliseconds
72.22% <= 2 milliseconds
99.12% <= 3 milliseconds
99.95% <= 4 milliseconds
99.99% <= 5 milliseconds
100.00% <= 6 milliseconds
87992.09 requests per second


====== SET ======
  100009 requests completed in 1.20 seconds
  200 parallel clients
  100 bytes payload
  keep alive: 1

0.03% <= 0 milliseconds
6.01% <= 1 milliseconds
63.68% <= 2 milliseconds
94.24% <= 3 milliseconds
98.47% <= 4 milliseconds
99.54% <= 5 milliseconds
99.86% <= 6 milliseconds
99.98% <= 7 milliseconds
100.00% <= 8 milliseconds
100.00% <= 9 milliseconds
83549.70 requests per second

====== GET ======
  100088 requests completed in 1.11 seconds
  200 parallel clients
  100 bytes payload
  keep alive: 1

0.01% <= 0 milliseconds
5.97% <= 1 milliseconds
76.05% <= 2 milliseconds
98.32% <= 3 milliseconds
99.93% <= 4 milliseconds
99.99% <= 5 milliseconds
99.99% <= 6 milliseconds
100.00% <= 9 milliseconds
100.00% <= 10 milliseconds
100.00% <= 11 milliseconds
100.00% <= 12 milliseconds
90495.48 requests per second


====== SET ======
  100001 requests completed in 1.13 seconds
  200 parallel clients
  100 bytes payload
  keep alive: 1

0.03% <= 0 milliseconds
8.84% <= 1 milliseconds
71.48% <= 2 milliseconds
95.39% <= 3 milliseconds
99.17% <= 4 milliseconds
99.78% <= 5 milliseconds
99.94% <= 6 milliseconds
99.99% <= 7 milliseconds
100.00% <= 8 milliseconds
100.00% <= 9 milliseconds
88184.30 requests per second

====== GET ======
  100058 requests completed in 1.12 seconds
  200 parallel clients
  100 bytes payload
  keep alive: 1

0.01% <= 0 milliseconds
4.61% <= 1 milliseconds
75.07% <= 2 milliseconds
98.56% <= 3 milliseconds
99.91% <= 4 milliseconds
100.00% <= 5 milliseconds
100.00% <= 6 milliseconds
89497.31 requests per second


====== SET ======
  100027 requests completed in 1.15 seconds
  200 parallel clients
  100 bytes payload
  keep alive: 1

0.01% <= 0 milliseconds
2.28% <= 1 milliseconds
71.93% <= 2 milliseconds
97.66% <= 3 milliseconds
99.46% <= 4 milliseconds
99.83% <= 5 milliseconds
99.94% <= 6 milliseconds
99.99% <= 7 milliseconds
100.00% <= 8 milliseconds
100.00% <= 9 milliseconds
86904.43 requests per second

====== GET ======
  100028 requests completed in 1.13 seconds
  200 parallel clients
  100 bytes payload
  keep alive: 1

0.03% <= 0 milliseconds
6.33% <= 1 milliseconds
70.60% <= 2 milliseconds
97.89% <= 3 milliseconds
99.80% <= 4 milliseconds
99.98% <= 5 milliseconds
100.00% <= 6 milliseconds
100.00% <= 7 milliseconds
88285.97 requests per second


====== SET ======
  100010 requests completed in 1.15 seconds
  200 parallel clients
  100 bytes payload
  keep alive: 1

0.04% <= 0 milliseconds
7.97% <= 1 milliseconds
69.29% <= 2 milliseconds
94.72% <= 3 milliseconds
98.84% <= 4 milliseconds
99.67% <= 5 milliseconds
99.91% <= 6 milliseconds
99.99% <= 7 milliseconds
100.00% <= 8 milliseconds
100.00% <= 9 milliseconds
100.00% <= 10 milliseconds
86588.75 requests per second

====== GET ======
  100019 requests completed in 1.13 seconds
  200 parallel clients
  100 bytes payload
  keep alive: 1

0.00% <= 0 milliseconds
5.06% <= 1 milliseconds
71.72% <= 2 milliseconds
98.12% <= 3 milliseconds
99.85% <= 4 milliseconds
99.97% <= 5 milliseconds
99.99% <= 6 milliseconds
100.00% <= 7 milliseconds
88356.01 requests per second


====== SET ======
  100018 requests completed in 1.09 seconds
  200 parallel clients
  100 bytes payload
  keep alive: 1

0.01% <= 0 milliseconds
8.61% <= 1 milliseconds
80.37% <= 2 milliseconds
98.63% <= 3 milliseconds
99.92% <= 4 milliseconds
99.99% <= 5 milliseconds
99.99% <= 6 milliseconds
100.00% <= 8 milliseconds
100.00% <= 9 milliseconds
100.00% <= 10 milliseconds
91843.90 requests per second

====== GET ======
  100016 requests completed in 1.11 seconds
  200 parallel clients
  100 bytes payload
  keep alive: 1

0.00% <= 0 milliseconds
3.61% <= 1 milliseconds
76.30% <= 2 milliseconds
99.04% <= 3 milliseconds
99.92% <= 4 milliseconds
100.00% <= 5 milliseconds
100.00% <= 6 milliseconds
89942.45 requests per second


====== SET ======
  100026 requests completed in 1.19 seconds
  200 parallel clients
  100 bytes payload
  keep alive: 1

0.05% <= 0 milliseconds
9.44% <= 1 milliseconds
58.47% <= 2 milliseconds
96.13% <= 3 milliseconds
99.14% <= 4 milliseconds
99.75% <= 5 milliseconds
99.91% <= 6 milliseconds
99.97% <= 7 milliseconds
99.98% <= 8 milliseconds
99.99% <= 9 milliseconds
100.00% <= 10 milliseconds
100.00% <= 11 milliseconds
83914.43 requests per second

====== GET ======
  100048 requests completed in 1.13 seconds
  200 parallel clients
  100 bytes payload
  keep alive: 1

0.00% <= 0 milliseconds
3.43% <= 1 milliseconds
74.42% <= 2 milliseconds
98.08% <= 3 milliseconds
99.90% <= 4 milliseconds
99.99% <= 5 milliseconds
100.00% <= 6 milliseconds
100.00% <= 7 milliseconds
88773.73 requests per second


====== SET ======
  100043 requests completed in 1.12 seconds
  200 parallel clients
  100 bytes payload
  keep alive: 1

0.00% <= 0 milliseconds
4.14% <= 1 milliseconds
74.12% <= 2 milliseconds
98.48% <= 3 milliseconds
99.81% <= 4 milliseconds
99.95% <= 5 milliseconds
99.99% <= 6 milliseconds
100.00% <= 7 milliseconds
100.00% <= 8 milliseconds
89006.23 requests per second

====== GET ======
  100047 requests completed in 1.14 seconds
  200 parallel clients
  100 bytes payload
  keep alive: 1

3.01% <= 1 milliseconds
70.97% <= 2 milliseconds
98.83% <= 3 milliseconds
99.96% <= 4 milliseconds
100.00% <= 5 milliseconds
87606.84 requests per second


====== SET ======
  100056 requests completed in 1.10 seconds
  200 parallel clients
  100 bytes payload
  keep alive: 1

0.02% <= 0 milliseconds
7.55% <= 1 milliseconds
75.82% <= 2 milliseconds
97.88% <= 3 milliseconds
99.83% <= 4 milliseconds
99.96% <= 5 milliseconds
99.99% <= 6 milliseconds
99.99% <= 7 milliseconds
100.00% <= 16 milliseconds
100.00% <= 17 milliseconds
100.00% <= 18 milliseconds
90794.92 requests per second

====== GET ======
  100031 requests completed in 1.15 seconds
  200 parallel clients
  100 bytes payload
  keep alive: 1

0.01% <= 0 milliseconds
7.22% <= 1 milliseconds
75.08% <= 2 milliseconds
97.11% <= 3 milliseconds
99.61% <= 4 milliseconds
99.88% <= 5 milliseconds
99.98% <= 6 milliseconds
99.99% <= 7 milliseconds
100.00% <= 8 milliseconds
100.00% <= 9 milliseconds
87135.02 requests per second


====== SET ======
  100008 requests completed in 1.09 seconds
  200 parallel clients
  100 bytes payload
  keep alive: 1

0.03% <= 0 milliseconds
10.73% <= 1 milliseconds
74.65% <= 2 milliseconds
97.29% <= 3 milliseconds
99.78% <= 4 milliseconds
99.99% <= 5 milliseconds
100.00% <= 6 milliseconds
91414.99 requests per second

====== GET ======
  100021 requests completed in 1.10 seconds
  200 parallel clients
  100 bytes payload
  keep alive: 1

0.08% <= 0 milliseconds
22.52% <= 1 milliseconds
91.73% <= 2 milliseconds
99.57% <= 3 milliseconds
99.96% <= 4 milliseconds
100.00% <= 5 milliseconds
91343.38 requests per second


====== SET ======
  100006 requests completed in 1.09 seconds
  200 parallel clients
  100 bytes payload
  keep alive: 1

0.07% <= 0 milliseconds
11.93% <= 1 milliseconds
76.33% <= 2 milliseconds
96.72% <= 3 milliseconds
99.34% <= 4 milliseconds
99.83% <= 5 milliseconds
99.93% <= 6 milliseconds
99.97% <= 7 milliseconds
99.98% <= 8 milliseconds
99.99% <= 9 milliseconds
99.99% <= 10 milliseconds
100.00% <= 11 milliseconds
100.00% <= 12 milliseconds
100.00% <= 13 milliseconds
92086.56 requests per second

====== GET ======
  100034 requests completed in 1.09 seconds
  200 parallel clients
  100 bytes payload
  keep alive: 1

3.59% <= 1 milliseconds
82.91% <= 2 milliseconds
99.08% <= 3 milliseconds
99.97% <= 4 milliseconds
99.99% <= 5 milliseconds
99.99% <= 6 milliseconds
100.00% <= 9 milliseconds
100.00% <= 11 milliseconds
100.00% <= 12 milliseconds
91858.59 requests per second